Revit 2024 API
RebarShapeConstraintFixedSegmentDir Members
The RebarShapeConstraintFixedSegmentDir type exposes the following members.
Constructors
Name | Description
RebarShapeConstraintFixedSegmentDir
 Create a fixed segment direction constraint.
Methods
Name | Description
Dispose |  (Inherited from RebarShapeConstraint.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParamId
 Return the Id of the parameter associated with this constraint.
 (Inherited from RebarShapeConstraint.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Direction
 The direction of the RebarShapeSegment in UV-space.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraintFixedSegmentDir Class
Autodesk.Revit.DB.Structure Namespace